Revit 2026 API

# BuiltInFailuresConstraintFailures Class

---

Failures about Constraint.

SystemObject Autodesk.Revit.DBBuiltInFailuresConstraintFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ConstraintFailures
```
```vb
Public NotInheritable Class ConstraintFailures
```
```cpp
public ref class ConstraintFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ConstraintFailures = class end
```

The BuiltInFailuresConstraintFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | UndeletedConstraints | A dimension that has lock constraints is being deleted, but the elements will still be constrained. Push "Unconstrain" to remove the constraints or "OK" to leave elements constrained.. |
|  | UndeletedConstraintsEQ | A dimension that has EQ constraints is being deleted, but the elements will still be constrained. Push "Unconstrain" to remove the constraints or "OK" to leave elements constrained.. |
|  | UndeletedConstraintsInGroup | A labeled dimension is being deleted, but the corresponding constraint belongs to a group and will not be changed. You can change it in group edit mode later. |
|  | UndeletedConstraintsLabel | A dimension labeled by a parameter is being deleted, but the elements will still be constrained. Push "Unconstrain" to remove the constraints or "OK" to leave elements constrained.. |

#### Reference

Autodesk.Revit.DB Namespace